## Introduction to Databases

### Accessing Relational Databases - MySQL

In [1]:
#!pip install -q -U pymysql sqlalchemy

In [2]:
import os
import sys
import time
import datetime
import numpy as np
import pandas as pd
import pathlib
import getpass

import pymysql

### Acessing [MySQL](https://pypi.python.org/pypi/PyMySQL)

In [3]:
p = getpass.getpass()
connection = pymysql.connect(host='localhost', port=3306, user='root', passwd=p) #, db='mysql')
cursor = connection.cursor()
connection.autocommit(True)

 ·········

#### Inspecting Databases

In [4]:
cursor.execute("show databases;")
for r in cursor.fetchall():
    print(r)

('Bercario',)
('LearningSQL',)
('Reuters',)
('information_schema',)
('matrix',)
('mysql',)
('performance_schema',)
('sys',)

#### Choosing Database and showing Tables

In [5]:
cursor.execute("use LearningSQL;")
cursor.execute("show tables;")
for r in cursor.fetchall():
    print(r)

('account',)
('branch',)
('business',)
('customer',)
('department',)
('employee',)
('individual',)
('officer',)
('product',)
('product_type',)
('transaction',)

#### Creating a new Table

In [6]:
cursor.execute("CREATE DATABASE IF NOT EXISTS example;")
cursor.execute("USE example;")
cursor.execute('''CREATE TABLE my_table (id int NOT NULL AUTO_INCREMENT,
                                         text varchar(200)  NULL,
                                         CONSTRAINT my_table_pk PRIMARY KEY (id)
                                         )
                  ENGINE=MyISAM 
                  DEFAULT CHARSET='utf8';'''
              )

cursor.execute("show tables;")
for r in cursor.fetchall():
    print(r)

('my_table',)

#### Deleting records on table (if any) -- be careful!

In [7]:
cursor.execute("delete from example.my_table;")
cursor.commit()
for r in cursor.fetchall():
    print(r)

#### Inserting data on table

In [8]:
texts = ['It always seems impossible until its done.',
         'In order to succeed, we must first believe that we can.',
         'Life is 10% what happens to you and 90% how you react to it.',
         'Start where you are. Use what you have. Do what you can.',]

cursor.executemany('INSERT INTO example.my_table (text) VALUES (%s)', texts)

4

#### Querying  

+ fetchall()
+ fetchmany(#)
+ fetchone()

In [9]:
cursor.execute("SELECT * FROM example.my_table;")# LIMIT 10;")

for r in cursor.fetchall():
    print(r)

(1, 'It always seems impossible until its done.')
(2, 'In order to succeed, we must first believe that we can.')
(3, 'Life is 10% what happens to you and 90% how you react to it.')
(4, 'Start where you are. Use what you have. Do what you can.')

In [10]:
for r in cursor.fetchall():
    print(r)

In [11]:
cursor.execute("SELECT * FROM example.my_table;")

4

In [12]:
for r in cursor.fetchmany(3):
    print(r)

(1, 'It always seems impossible until its done.')
(2, 'In order to succeed, we must first believe that we can.')
(3, 'Life is 10% what happens to you and 90% how you react to it.')

In [13]:
for r in cursor.fetchone():
    print(r)

4
Start where you are. Use what you have. Do what you can.

In [14]:
for r in cursor.fetchone():  #error
    print(r)

TypeError: 'NoneType' object is not iterable

### Using Pandas for querying

In [15]:
import pandas.io.sql as psql

In [16]:
df_mysql = psql.read_sql('SELECT * FROM example.my_table;', con=connection)

In [17]:
df_mysql.head()

   id                                               text
0   1         It always seems impossible until its done.
1   2  In order to succeed, we must first believe tha...
2   3  Life is 10% what happens to you and 90% how yo...
3   4  Start where you are. Use what you have. Do wha...

In [18]:
cursor.close()
connection.close()

### Using Pandas for reading a [CSV](https://www.generatedata.com/) file and [write in a Database](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html)

#### Reading fake data file

In [19]:
df = pd.read_csv('../SampleDBs/fakedata.csv', sep='|')
df.head(10)

        name                                 email birthdate
0     Fatima       Quisque.varius@Integervitae.org  11-25-01
1    Katelyn              mi.pede.nonummy@Sedid.ca  11-27-03
2    Gillian  odio.semper@sodalesMaurisblandit.org  02-19-14
3    Preston        faucibus.orci@lacusQuisque.edu  08-07-09
4  Priscilla  semper.auctor@cursusvestibulum.co.uk  08-12-01
5       Zena                ante@magnaPraesent.com  11-24-11
6       Oren            rutrum.eu.ultrices@nec.org  01-12-07
7    Jamalia        Phasellus.vitae.mauris@vel.org  05-17-17
8      Libby               velit.eu@Maecenasmi.edu  07-29-17
9       Finn         natoque.penatibus@lectusa.net  06-23-10

#### Creating the Database

In [21]:
user = 'root'
p = getpass.getpass()
host =  'localhost'
port = 3306
database = 'new_example'

conn = pymysql.connect(host=host, port=port, user=user, passwd=p)
conn.cursor().execute(f"CREATE DATABASE IF NOT EXISTS {database}")

 ·········

1

#### Dumping the Dataframe to the Database in a new table using [Pandas](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_sql.html) and SQLalchemy

In [22]:
from sqlalchemy import create_engine

In [25]:
#engine = create_engine('mysql+pymysql://user:password@localhost/database')
engine = create_engine(f'mysql+pymysql://root:{p}@localhost/new_example')
df.to_sql(name='my_new_table', con=engine, if_exists='replace', index=True, index_label='id_user')

#### Setting the Primary Key

In [26]:
with engine.connect() as conn:
    conn.execute('ALTER TABLE my_new_table ADD PRIMARY KEY (id_user);')

#### Verifying the Results

In [27]:
conn = pymysql.connect(host=host, port=port, user=user, passwd=p)
cur = conn.cursor()

In [28]:
cur.execute("show databases;")
for r in cur.fetchall():
     print(r)

('Bercario',)
('LearningSQL',)
('Reuters',)
('information_schema',)
('matrix',)
('mysql',)
('new_example',)
('performance_schema',)
('sys',)

In [29]:
cur.execute("use new_example;")
cur.execute("show tables;")
for r in cur.fetchall():
     print(r)

('my_new_table',)

In [30]:
cur.execute("describe my_new_table;")
for r in cur.fetchall():
     print(r)

('id_user', 'bigint', 'NO', 'PRI', None, '')
('name', 'text', 'YES', '', None, '')
('email', 'text', 'YES', '', None, '')
('birthdate', 'text', 'YES', '', None, '')

In [31]:
cur.execute("select * from my_new_table;")
for r in cur.fetchmany(10):
     print(r)

(0, 'Fatima', 'Quisque.varius@Integervitae.org', '11-25-01')
(1, 'Katelyn', 'mi.pede.nonummy@Sedid.ca', '11-27-03')
(2, 'Gillian', 'odio.semper@sodalesMaurisblandit.org', '02-19-14')
(3, 'Preston', 'faucibus.orci@lacusQuisque.edu', '08-07-09')
(4, 'Priscilla', 'semper.auctor@cursusvestibulum.co.uk', '08-12-01')
(5, 'Zena', 'ante@magnaPraesent.com', '11-24-11')
(6, 'Oren', 'rutrum.eu.ultrices@nec.org', '01-12-07')
(7, 'Jamalia', 'Phasellus.vitae.mauris@vel.org', '05-17-17')
(8, 'Libby', 'velit.eu@Maecenasmi.edu', '07-29-17')
(9, 'Finn', 'natoque.penatibus@lectusa.net', '06-23-10')

## Creating a set of tables from a SQL file

![Db Schema](../Figs/Nursery.png)

In [3]:
p = getpass.getpass()
connection = pymysql.connect(host='localhost', port=3306, user='root', passwd=p) #, db='mysql')
cursor = connection.cursor()
connection.autocommit(True)

 ·········

In [4]:
with open('../SampleDBs/nursery_create.sql') as f:
    nursery_creation_sql = f.read()
    
nursery_creation_sql_list = nursery_creation_sql.split(';')
nursery_creation_sql_list = [q+';' for q in nursery_creation_sql_list][:-1]

In [5]:
for query in nursery_creation_sql_list:
    print(query)
    print(cursor.execute(query))

DROP DATABASE IF EXISTS Nursery;
6

CREATE DATABASE IF NOT EXISTS Nursery;
1

USE Nursery;
0


CREATE TABLE Nursery.baby (
    id int AUTO_INCREMENT NOT NULL,
    id_mother int NOT NULL,
    id_doctor int NOT NULL,
    name_baby varchar(60) NOT NULL,
    date_baby date NOT NULL,
    height_baby int NULL,
    weight_baby int NULL,
    CONSTRAINT baby_pk PRIMARY KEY (id)
);
0


CREATE TABLE Nursery.specializations (
    id int AUTO_INCREMENT NOT NULL,
    name_specialization varchar(60) NOT NULL,
    CONSTRAINT specializations_pk PRIMARY KEY (id)
);
0


CREATE TABLE Nursery.mother (
    id int AUTO_INCREMENT NOT NULL,
    name_mother varchar(1500) NOT NULL,
    street varchar(60) NULL,
    streetnumber varchar(20) NULL,
    zip char(8) NULL,
    date_mother date NULL,
    CONSTRAINT mother_pk PRIMARY KEY (id)
);
0


CREATE TABLE Nursery.doctor (
    id int AUTO_INCREMENT NOT NULL,
    register char(10) NOT NULL,
    name varchar(60) NOT NULL,
    id_specialization int NOT NULL,
    CONSTRAINT doctor_pk PRIMARY KEY (id)
);
0


CREATE TABLE Nursery.phone_mother (
    id int AUTO_INCREMENT NOT NULL,
    id_mother int NOT NULL,
    phone varchar(13) NOT NULL,
    CONSTRAINT phone_mother_pk PRIMARY KEY (id)
);
0


CREATE TABLE Nursery.phone_doctor (
    id int AUTO_INCREMENT NOT NULL,
    id_doctor int NOT NULL,
    phone varchar(13) NOT NULL,
    CONSTRAINT phone_doctor_pk PRIMARY KEY (id)
);
0


ALTER TABLE baby ADD CONSTRAINT baby_mother FOREIGN KEY baby_mother (id_mother)
    REFERENCES Nursery.mother (id);
0


ALTER TABLE baby ADD CONSTRAINT baby_doctor FOREIGN KEY baby_doctor (id_doctor)
    REFERENCES Nursery.doctor (id);
0


ALTER TABLE doctor ADD CONSTRAINT doctor_specializations FOREIGN KEY doctor_specializations (id_specialization)
    REFERENCES Nursery.specializations (id);
0


ALTER TABLE phone_mother ADD CONSTRAINT phone_mother FOREIGN KEY phone_mother (id_mother)
    REFERENCES Nursery.mother (id);
0


ALTER TABLE phone_doctor ADD CONSTRAINT phone_doctor FOREIGN KEY phone_doctor (id_doctor)
    REFERENCES Nursery.doctor (id);
0

#### Populating Tables

+ #### Specializations

In [6]:
specializations = ['Allergy and immunology',
                   'Anesthesiology',
                   'Dermatology',
                   'Diagnostic radiology',
                   'Emergency medicine',
                   'Family medicine',
                   'Internal medicine',
                   'Medical genetics',
                   'Neurology',
                   'Nuclear medicine',
                   'Obstetrics and gynecology',
                   'Ophthalmology',
                   'Pathology',
                   'Pediatrics',
                   'Physical medicine and rehabilitation',
                   'Preventive medicine',
                   'Psychiatry',
                   'Radiation oncology',
                   'Surgery',
                   'Urology']

cursor.executemany('INSERT INTO Nursery.specializations (name_specialization) VALUES (%s);', specializations)
#connection.commit()

20

In [7]:
cursor.execute("SELECT * FROM Nursery.specializations;")
for r in cursor.fetchmany(5):
    print(r)

(1, 'Allergy and immunology')
(2, 'Anesthesiology')
(3, 'Dermatology')
(4, 'Diagnostic radiology')
(5, 'Emergency medicine')

+ #### Mothers

In [8]:
mothers = [('Ana Maria', 'Sagedergasse', '21A', '1120', '1947-01-07'),
           ('Yvonne', 'Nestor Victor St.', '55', '22450', '1956-04-03')
          ]

cursor.executemany('INSERT INTO Nursery.mother (name_mother, street, streetnumber, zip, date_mother) VALUES (%s,%s,%s,%s,%s);', mothers)

2

In [9]:
cursor.execute("SELECT * FROM Nursery.mother;")
for r in cursor.fetchall():
    print(r)

(1, 'Ana Maria', 'Sagedergasse', '21A', '1120', datetime.date(1947, 1, 7))
(2, 'Yvonne', 'Nestor Victor St.', '55', '22450', datetime.date(1956, 4, 3))

+ #### Doctors

In [11]:
doctors = [('34574', 'Gregory House', 11),
           ('67342', 'Henry Jekyll', 14)
          ]

cursor.executemany('INSERT INTO Nursery.doctor (register, name, id_specialization) VALUES (%s,%s,%s);', doctors)

2

In [13]:
cursor.execute("SELECT * FROM Nursery.doctor;")
for r in cursor.fetchall():
    print(r)

(1, '34574', 'Gregory House', 11)
(2, '67342', 'Henry Jekyll', 14)

+ #### Babies

In [14]:
babies = [(1, 2, 'Baby Johnson', '2021-02-08', 52, 3980),
          (2, 1, 'Baby Yoda', '2021-01-02', 41, 2675)
          ]

cursor.executemany('INSERT INTO Nursery.baby (id_mother, id_doctor, name_baby, date_baby, height_baby, weight_baby) VALUES (%s,%s,%s,%s,%s,%s);', babies)

2

In [15]:
cursor.execute("SELECT * FROM Nursery.baby;")
for r in cursor.fetchall():
    print(r)

(1, 1, 2, 'Baby Johnson', datetime.date(2021, 2, 8), 52, 3980)
(2, 2, 1, 'Baby Yoda', datetime.date(2021, 1, 2), 41, 2675)

+ #### Doctors' telephones

In [17]:
doctor_phone = [(2, 2132267728),
                (1, 2132869851)
          ]

cursor.executemany('INSERT INTO Nursery.phone_doctor (id_doctor, phone) VALUES (%s,%s);', doctor_phone)

2

In [20]:
cursor.execute("SELECT * FROM Nursery.phone_doctor;")
for r in cursor.fetchall():
    print(r)

(1, 2, '2132267728')
(2, 1, '2132869851')

+ #### Mothers' telephones

In [19]:
mother_phone = [(1, 2124315480),
                (2, 2122777380)
          ]

cursor.executemany('INSERT INTO Nursery.phone_mother (id_mother, phone) VALUES (%s,%s);', mother_phone)

2

In [21]:
cursor.execute("SELECT * FROM Nursery.phone_mother;")
for r in cursor.fetchall():
    print(r)

(1, 1, '2124315480')
(2, 2, '2122777380')

### A combined query

In [ ]:
query = '''
SELECT doctor.name AS 'Doctor', mother.name_mother AS 'Mother', baby.name_baby AS 'Baby', baby.date_baby AS 'Birth Date' 
FROM doctor
INNER JOIN baby
ON baby.id_doctor = doctor.id
INNER JOIN mother
ON baby.id_mother = mother.id
'''

#### With Cursor

In [24]:
cursor.execute(query)
for r in cursor.fetchall():
    print(r)

('Henry Jekyll', 'Ana Maria', 'Baby Johnson', datetime.date(2021, 2, 8))
('Gregory House', 'Yvonne', 'Baby Yoda', datetime.date(2021, 1, 2))

#### With Pandas

In [26]:
df = pd.read_sql(query, con=connection)
df.head()

          Doctor     Mother          Baby  Birth Date
0   Henry Jekyll  Ana Maria  Baby Johnson  2021-02-08
1  Gregory House     Yvonne     Baby Yoda  2021-01-02